In [12]:
import numpy as np
import pandas as pd
stuff={'a':[1,2,3],'b':[4,np.nan,6],'c':[7,8,9],'d':[10,11,12]}
my_df=pd.DataFrame(stuff)

In [13]:
my_df

   a    b  c   d
0  1  4.0  7  10
1  2  NaN  8  11
2  3  6.0  9  12

In [7]:
my_df.dropna()

   a    b  c   d
0  1  4.0  7  10
2  3  6.0  9  12

In [8]:
my_df.dropna(axis=1)

   a  c   d
0  1  7  10
1  2  8  11
2  3  9  12

In [11]:
my_df.dropna(thresh=2,axis=1)

   a  c   d
0  1  7  10
1  2  8  11
2  3  9  12

In [15]:
my_df.fillna(value=99)

   a     b  c   d
0  1   4.0  7  10
1  2  99.0  8  11
2  3   6.0  9  12

In [16]:
my_df.fillna(value=my_df['b'].mean())

   a    b  c   d
0  1  4.0  7  10
1  2  5.0  8  11
2  3  6.0  9  12

In [17]:
my_df.fillna(value=my_df['b'].min())

   a    b  c   d
0  1  4.0  7  10
1  2  4.0  8  11
2  3  6.0  9  12